
## Plan Result (oidc)

[CI link](https://github.com/nangashi/dcr/actions/runs/7366947230)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 4 to destroy.</code></pre>

* Create
  * aws_iam_role.administrator[&#34;dev&#34;]
  * aws_iam_role.administrator[&#34;prd&#34;]
  * aws_iam_role.read_only[&#34;dev&#34;]
  * aws_iam_role.read_only[&#34;prd&#34;]
  * aws_iam_role_policy_attachment.administrator[&#34;dev&#34;]
  * aws_iam_role_policy_attachment.administrator[&#34;prd&#34;]
  * aws_iam_role_policy_attachment.read_only[&#34;dev&#34;]
  * aws_iam_role_policy_attachment.read_only[&#34;prd&#34;]
* Delete
  * aws_iam_role.administrator
  * aws_iam_role.read_only
  * aws_iam_role_policy_attachment.administrator
  * aws_iam_role_policy_attachment.read_only


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_role.administrator will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_iam_role" "administrator" {
      - arn                   = "arn:aws:iam::384081048358:role/AdministratorOidc-prd" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:sub" = "repo:nangashi/dcr:environment:production"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::384081048358:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-12-13T00:21:50Z" -> null
      - description           = "IAM Role for GitHub Actions OIDC" -> null
      - force_detach_policies = false -> null
      - id                    = "AdministratorOidc-prd" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AdministratorAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "AdministratorOidc-prd" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "prd"
          - "ManagedBy"   = "Terraform"
        } -> null
      - unique_id             = "AROAVS3IDWMTISZMGAK4U" -> null
    }

  # aws_iam_role.administrator["dev"] will be created
  + resource "aws_iam_role" "administrator" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:sub" = "repo:nangashi/dcr:environment:production"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::384081048358:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM Role for GitHub Actions OIDC"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AdministratorOidc-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.administrator["prd"] will be created
  + resource "aws_iam_role" "administrator" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:sub" = "repo:nangashi/dcr:environment:production"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::384081048358:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM Role for GitHub Actions OIDC"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AdministratorOidc-prd"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.read_only will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_iam_role" "read_only" {
      - arn                   = "arn:aws:iam::384081048358:role/ReadOnlyOidc-prd" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "token.actions.githubusercontent.com:sub" = "repo:nangashi/dcr:environment:development"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::384081048358:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2023-12-12T23:23:04Z" -> null
      - description           = "IAM Role for GitHub Actions OIDC" -> null
      - force_detach_policies = false -> null
      - id                    = "ReadOnlyOidc-prd" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/ReadOnlyAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "ReadOnlyOidc-prd" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "prd"
          - "ManagedBy"   = "Terraform"
        } -> null
      - unique_id             = "AROAVS3IDWMTJQ4JCCHZ5" -> null
    }

  # aws_iam_role.read_only["dev"] will be created
  + resource "aws_iam_role" "read_only" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:sub" = "repo:nangashi/dcr:environment:development"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::384081048358:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM Role for GitHub Actions OIDC"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ReadOnlyOidc-dev"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.read_only["prd"] will be created
  + resource "aws_iam_role" "read_only" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:sub" = "repo:nangashi/dcr:environment:development"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::384081048358:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM Role for GitHub Actions OIDC"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ReadOnlyOidc-prd"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prd"
          + "ManagedBy"   = "Terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.administrator will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_iam_role_policy_attachment" "administrator" {
      - id         = "AdministratorOidc-prd-20231213002150253100000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess" -> null
      - role       = "AdministratorOidc-prd" -> null
    }

  # aws_iam_role_policy_attachment.administrator["dev"] will be created
  + resource "aws_iam_role_policy_attachment" "administrator" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "AdministratorOidc-dev"
    }

  # aws_iam_role_policy_attachment.administrator["prd"] will be created
  + resource "aws_iam_role_policy_attachment" "administrator" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
      + role       = "AdministratorOidc-prd"
    }

  # aws_iam_role_policy_attachment.read_only will be destroyed
  # (because resource uses count or for_each)
  - resource "aws_iam_role_policy_attachment" "read_only" {
      - id         = "ReadOnlyOidc-prd-20231212232303861000000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess" -> null
      - role       = "ReadOnlyOidc-prd" -> null
    }

  # aws_iam_role_policy_attachment.read_only["dev"] will be created
  + resource "aws_iam_role_policy_attachment" "read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "ReadOnlyOidc-dev"
    }

  # aws_iam_role_policy_attachment.read_only["prd"] will be created
  + resource "aws_iam_role_policy_attachment" "read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "ReadOnlyOidc-prd"
    }

Plan: 8 to add, 0 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":38,"Program":"tfcmt","SHA1":"ce760c3b00f3197f443f2bcd844ea2b2a83c3387","Target":"oidc","Vars":{},"WorkflowName":"Check Pull Requests"} -->